# Hacker scores

* Source: https://www.hackerrank.com/contests/simply-sql-the-sequel/challenges/full-score
* Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

Given the following two tables, write a query to return the hacker ID, name, and total score (the sum of maximum scores for each challenge completed) ordered by descending score, and by ascending hacker ID in the case of score tie. Do not display entries for hackers with a score of zero.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `hackers` table

In [3]:
%%sql

DROP TABLE IF EXISTS hackers;
CREATE TABLE hackers (
    hacker_id INT,
    name VARCHAR(4)
);

INSERT INTO hackers
VALUES
    (1, 'John'),
    (2, 'Jane'),
    (3, 'Joe'),
    (4, 'Jim');
    
SELECT * FROM hackers;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
4 rows affected.
4 rows affected.

[(1, 'John'), (2, 'Jane'), (3, 'Joe'), (4, 'Jim')]

## The `submissions` table

In [4]:
%%sql

DROP TABLE IF EXISTS submissions;
CREATE TABLE submissions (
    submission_id INT,
    hacker_id     INT,
    challenge_id  INT,
    score         INT
);

INSERT INTO submissions
VALUES
    (101, 1, 1, 10),
    (102, 1, 1, 12),
    (103, 2, 1, 11),
    (104, 2, 1, 9),
    (105, 2, 2, 13),
    (106, 3, 1, 9),
    (107, 3, 2, 12),
    (108, 3, 2, 15),
    (109, 4, 1, 0);
    
SELECT * FROM submissions;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(101, 1, 1, 10),
 (102, 1, 1, 12),
 (103, 2, 1, 11),
 (104, 2, 1, 9),
 (105, 2, 2, 13),
 (106, 3, 1, 9),
 (107, 3, 2, 12),
 (108, 3, 2, 15),
 (109, 4, 1, 0)]

## The expected output

| hacker_id | name | total_score |
|---------- |----- |------------ |
| 2         | Jane | 24          |
| 3         | Joe  | 24          |
| 1         | John | 12          |

# Type your SQL below

In [6]:
# %% sql
#
# Type your query here